In [5]:
import pandas as pd
train = pd.read_csv("http://bit.ly/kaggletrain")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# Map For series
train["sex_num"]=train["Sex"].map({"female":0,"male":1})
train.loc[0:2,["Sex","sex_num"]]

      Sex  sex_num
0    male        1
1  female        0
2  female        0

In [14]:
# apply for series
train["name_length"]=train["Name"].apply(len)
train.loc[0:2,["Name","name_length"]]

                                                Name  name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22

In [15]:
# apply for series
import numpy as np
train["fare_ceil"]=train["Fare"].apply(np.ceil)
train.loc[0:2,["Fare","fare_ceil"]]

      Fare  fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0

In [17]:
# apply for series
train.Name.str.split(",").apply(lambda x: x[0]).head(3)

0       Braund
1      Cumings
2    Heikkinen
Name: Name, dtype: object

In [23]:
drink = pd.read_csv("http://bit.ly/drinksbycountry")
drink.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa

In [26]:
# apply for dataframe
drink.loc[:,"beer_servings":"total_litres_of_pure_alcohol"].apply(max,axis=0)

beer_servings                   376.0
spirit_servings                 438.0
wine_servings                   370.0
total_litres_of_pure_alcohol     14.4
dtype: float64

In [30]:
# apply for dataframe
drink.loc[:,"beer_servings":"total_litres_of_pure_alcohol"].apply(max,axis=1).head(3)

0      0.0
1    132.0
2     25.0
dtype: float64

In [31]:
# apply for dataframe
drink.loc[:,"beer_servings":"total_litres_of_pure_alcohol"].apply(np.argmax,axis=1).head(3)

0      beer_servings
1    spirit_servings
2      beer_servings
dtype: object

In [33]:
# applymap for dataframe
drink.loc[:,"beer_servings":"total_litres_of_pure_alcohol"].applymap(float).head(3)

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0            0.0              0.0            0.0                           0.0
1           89.0            132.0           54.0                           4.9
2           25.0              0.0           14.0                           0.7